/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: abiestro <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/05/19 20:03:51 by abiestro          #+#    #+#             */
/*   Updated: 2018/05/23 22:25:12 by abiestro         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
#include <locale.h>
#include <wchar.h>
#include "includes/ft_printf.h"
int main()
{
printf("%d", printf("%lc, %lc", L'暖', L'ح'));
printf("%d",ft_printf("%lc, %lc", L'暖', L'ح'));
}
